zahidul3/athan-clock/BOOSTXL-K350QVG-S1_GrlibExample_MSP432P401R/main.c
/* --COPYRIGHT--,BSD
 * Copyright (c) 2014, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * --/COPYRIGHT--*/


/*********************************************************************
 * INCLUDES
 */
/* DriverLib Includes */
#include "driverlib.h"

/* Standard Includes */
#include <stdlib.h>
#include <stdio.h>
#include <stdint.h>
#include <string.h>
#include <stdbool.h>

/* GrLib Includes */
#include "grlib.h"
#include "button.h"
#include "imageButton.h"
#include "radioButton.h"
#include "checkbox.h"
#include "LcdDriver/kitronix320x240x16_ssd2119_spi.h"
#include "images/images.h"
#include "touch_P401R.h"

/* App Includes */
#include "uart_debug.h"
#include "uart_cc.h"
#include "IoDef.h"
#include "Common.h"

#include "TimerA.h"
#include "athanTransport.h"

//Touch screen context
touch_context g_sTouchContext;
Graphics_ImageButton primitiveButton;
Graphics_ImageButton imageButton;
Graphics_Button yesButton;
Graphics_Button noButton;

// Graphic library context
Graphics_Context g_sContext;

//Flag to know if a demo was run
bool g_ranDemo = false;

void Delay(uint16_t msec);
void boardInit(void);
void clockInit(void);
void initializeDemoButtons(void);
void drawMainMenu(void);
void runPrimitivesDemo(void);
void runImagesDemo(void);
void drawRestarDemo(void);

/*********************************************************************
 * MACROS
 */

/*********************************************************************
 * CONSTANTS
 */
/* Application Defines */
#define NAMAZ_START_POS             40
#define NAMAZ_SPACING               40

#define NAMAZ_TIME_START_POS_X      140
#define NAMAZ_TIME_SIZE             5

/*********************************************************************
 * TYPEDEFS
 */
typedef enum LCD_SCREEN
{
    MAIN_SCREEN,
    DATE_SCREEN
}LCD_SCREEN;


/*********************************************************************
 * GLOBAL VARIABLES
 */
TsDateTime currentDateTime =
        {
         0, //sec
         48, //min
         12, //hour
         7, //day
         5, //month
         19,//year
         2, //dayOfWeek 0-6, where 0 = Sunday
         0 //zone
        };

TsAthanTimesDay currentAthanTimesDay = {0};

LCD_SCREEN LcdScreen = MAIN_SCREEN;

/*********************************************************************
 * LOCAL VARIABLES
 */
uint8_t CurrentHour;
uint8_t CurrentMinute;
AMPM CurrentAMPM = PM;

uint16_t athanThreshold[6]= {4000, 5200, 6700, 8200, 9700, 17000};
const char* const arr[] = { "Fajr", "Sunrise", "Dhuhr", "Asr", "Maghrib", "Isha", 0 }; // all const
const char* const athan_strings[NUMBER_OF_ATHAN] = {"FAJR", "SUNRISE", "ZUHR", "ASR", "MAGHRIB", "ISHA"};

uint8_t alarmState = 0b00111101; //inverted bit field of alarm state

int32_t athanDescColor[6] = {GRAPHICS_COLOR_GREEN, GRAPHICS_COLOR_GRAY, GRAPHICS_COLOR_GREEN, GRAPHICS_COLOR_GREEN, GRAPHICS_COLOR_GREEN, GRAPHICS_COLOR_GREEN};

char buffer[DEBUG_BUFFER_SIZE];
char bufferTouch[DEBUG_BUFFER_SIZE];

static uint32_t sysTickCount = 0;
static uint16_t xSum, ySum;

void setCurrentDateTime(TsDateTime* dateTime)
{
    memcpy(&currentDateTime.Second, &dateTime->Second, sizeof(TsDateTime));
    //convert to 12 hr format
    if(dateTime->Hour>12)
    {
        dateTime->Hour -= 12;
        CurrentAMPM = PM;
    }
    else if(dateTime->Hour==0)
    {
        dateTime->Hour = 12;
        CurrentAMPM = AM;
    }
    else
    {
        CurrentAMPM = AM;
    }

    CurrentHour = dateTime->Hour;
    CurrentMinute = dateTime->Minute;
}

void printDateTime(TsDateTime* dateTime)
{
    memset(buffer, 0, DEBUG_BUFFER_SIZE);
    ltoa(currentDateTime.Month, buffer, 10);
    uint8_t strLen = strlen(buffer);
    buffer[strLen] = '/';
    ltoa(currentDateTime.Day, (buffer+strLen+1), 10);
    printDebugString("Received current date: ");
    printDebugString(buffer);
    printDebugString("\n\r");

    memset(buffer, 0, DEBUG_BUFFER_SIZE);
    ltoa(CurrentHour, buffer, 10);
    strLen = strlen(buffer);
    buffer[strLen] = ':';
    ltoa(CurrentMinute, (buffer+strLen+1), 10);
    printDebugString("Received current time: ");
    printDebugString(buffer);
    printDebugString("\n\r");
}

TsCurrentTime athanAlert;
bool bAthanAlert = false;

void handleRxMessage(TsAthanPacket* athanPacket)
{
    switch(athanPacket->dataType){
    case MSG_CURRENT_TIME:
        printDebugString("MSG_CURRENT_TIME rx!\n\r");
        printDateTime((TsDateTime*)&athanPacket->data);
        setCurrentDateTime((TsDateTime*)&athanPacket->data);
        drawMainMenu();
        break;
    case MSG_ATHAN_TIMES:
        printDebugString("MSG_ATHAN_TIMES rx!\n\r");
        memcpy(&currentAthanTimesDay.athanTimes[0].athanType, (TsAthanTimesDay*)&athanPacket->data, sizeof(TsAthanTimesDay));
        drawMainMenu();
        break;
    case MSG_ATHAN_ALERT:
        memcpy(&athanAlert, (TsCurrentTime*)&athanPacket->data, sizeof(TsCurrentTime));
        printDebugString(athan_strings[athanAlert.athanType]);
        printDebugString(" MSG_ATHAN_ALERT rx!!!\n\r");
        bAthanAlert = true;
        break;
    default:
        break;
    }
}

static uint32_t timeStampSec = 0;

void buttonIntHandler(void)
{
    GPIO_clearInterruptFlag(BUTTON1_PORT, BUTTON1_PIN);

    if((GetRunningTime() - timeStampSec) > 2) // 2s debounce
    {
        timeStampSec = GetRunningTime();
        //GPIO_disableInterrupt(BUTTON1_PORT, BUTTON1_PIN);
        printDebugString("Button Pressed!\n\r");

        TsButtonPress buttonAction;
        buttonAction.button = LEFT_KEY;
        buttonAction.pressed = 0x01;
        SendAthanPacket(MSG_BUTTON_PRESS, &buttonAction, sizeof(TsButtonPress));
    }
}

