zahidul3/athan-clock/BOOSTXL-K350QVG-S1_GrlibExample_MSP432P401R/main.c
/*
 * SysTick interrupt handler. This handler toggles HEARTBEAT LED on/off.
 */
void SysTick_Handler(void)
{
    sysTickCount++;
    //GPIO_toggleOutputOnPin(HEARTBEAT_PORT, HEARTBEAT_PIN);
}

//Crude polling method
void polling_delay_ms(uint16_t millis)
{
    uint32_t i,j = 0;
    uint32_t time = 120000;

    //for(j = 0; j < millis; j++)
    {
        for(i = 0; i < (time*millis); i++)
        {
            ;
        }
    }
}

void SendResetCmd(void)
{
    printDebugString("Sending reset cmd\n\r");
    SendAthanPacket(MSG_DEVICE_RESET, 0, 0);
}

TsLCDTouchCmd txData;

void main(void)
{
    int16_t ulIdx;
    WDT_A_hold(__WDT_A_BASE__);
    MAP_Interrupt_disableMaster();

    /* Initialize the demo. */
    boardInit();
    clockInit();
    initializeDemoButtons();
    TimerAInit();
    polling_delay_ms(64);
    //
    // Configure the pins that connect to the LCD as GPIO outputs.
    //
    GPIO_setAsOutputPin(CC_INT_PORT, CC_INT_PIN);
    GPIO_setOutputLowOnPin(CC_INT_PORT, CC_INT_PIN);

    GPIO_setAsOutputPin(HEARTBEAT_PORT, HEARTBEAT_PIN);
    GPIO_setOutputLowOnPin(HEARTBEAT_PORT, HEARTBEAT_PIN);

    GPIO_toggleOutputOnPin(HEARTBEAT_PORT, HEARTBEAT_PIN);

    //setup S1 Left Button GPIO
    GPIO_setAsInputPinWithPullUpResistor(BUTTON1_PORT, BUTTON1_PIN);
    MAP_GPIO_clearInterruptFlag(GPIO_PORT_P1, GPIO_PIN1);
    GPIO_interruptEdgeSelect(BUTTON1_PORT, BUTTON1_PIN, GPIO_HIGH_TO_LOW_TRANSITION);
    GPIO_registerInterrupt(BUTTON1_PORT, buttonIntHandler);
    GPIO_enableInterrupt(BUTTON1_PORT, BUTTON1_PIN);

    MAP_SysTick_setPeriod(12000000);
    MAP_SysTick_enableModule();

    initUART_CC();      //9600baud 8N1
    initUART0Debug();   //921600baud 8N1

    //MAP_Interrupt_enableSleepOnIsrExit();

    /* Globally enable interrupts. */
    MAP_Interrupt_enableMaster();
    MAP_SysTick_enableInterrupt();

    // LCD setup using Graphics Library API calls
    Kitronix320x240x16_SSD2119Init();
    Graphics_initContext(&g_sContext, &g_sKitronix320x240x16_SSD2119);
    Graphics_setBackgroundColor(&g_sContext, GRAPHICS_COLOR_BLACK);
    Graphics_setFont(&g_sContext, &g_sFontCmss36b);
    Graphics_clearDisplay(&g_sContext);

    touch_initInterface();

    SendResetCmd();
    drawMainMenu();

    printDebugString("Hello World!\n\r");
/*
    while(1)
    {
        MAP_PCM_gotoLPM0();
    }
*/

    // Loop to detect touch
    while(1)
    {
        /* Wait for a touch to be detected and wait ~4ms. */
        while(!touch_detectedTouch())
        {
            ;
        }
        touch_delay();

        /* Sample the X and Y measurements of the touch screen. */
        xSum = touch_sampleX();
        ySum = touch_sampleY();

        if(LcdScreen == DATE_SCREEN)
            drawMainMenu();

        if(bAthanAlert == true)
        {
            printDebugString("Touched during ALARM!\n\r");
            txData.command = TURN_OFF_ALARM;
            txData.data = 0x00;
            SendAthanPacket(MSG_LCD_CMD, &txData, sizeof(TsLCDTouchCmd));
            bAthanAlert = false;
        }
        else if(xSum > 1024)
        {
            memset(bufferTouch, 0, DEBUG_BUFFER_SIZE);
            ltoa(xSum, bufferTouch, 10);
            uint8_t strLenX = strlen(bufferTouch);
            bufferTouch[strLenX] = ',';
            ltoa(ySum,(&bufferTouch[strLenX+1]), 10);
            uint8_t strLen = strlen(bufferTouch);
            bufferTouch[strLen] = '\n';
            bufferTouch[strLen+1] = '\r';
            bufferTouch[strLen+2] = 0;
            //ltoa(ySum,(bufferTouch+strLen+1));
            //printDebugString("Touched: ");
            printDebugString(bufferTouch);

            if(ySum < 4600)
            {
                printDebugString("Touched Min!");
                txData.command = TIME_MIN_CMD;
                txData.data = 0x00;
                SendAthanPacket(MSG_LCD_CMD, &txData, sizeof(TsLCDTouchCmd));
            }
            else if(ySum < 7600)
            {
                printDebugString("Touched Hour!");
                txData.command = TIME_HOUR_CMD;
                txData.data = 0x00;
                SendAthanPacket(MSG_LCD_CMD, &txData, sizeof(TsLCDTouchCmd));
            }
            else if((ySum < 14000) && (xSum > 12000))
            {
                printDebugString("Touched TIME!");
                drawDateTimeMenu();
            }
            else
            {
                for(ulIdx=0; ulIdx<6; ulIdx++)
                {
                    if(xSum <= athanThreshold[ulIdx])
                    {
                        printDebugInt(ulIdx);
                        printDebugString(arr[ulIdx]);
                        if(athanDescColor[ulIdx] == GRAPHICS_COLOR_GREEN)
                        {
                            athanDescColor[ulIdx] = GRAPHICS_COLOR_GRAY;
                            alarmState = (alarmState & ~(1<<ulIdx)); //clear bit
                            txData.command = ALARM_CMD;
                            txData.data = alarmState;
                            SendAthanPacket(MSG_LCD_CMD, &txData, sizeof(TsLCDTouchCmd));
                        }
                        else
                        {
                            athanDescColor[ulIdx] = GRAPHICS_COLOR_GREEN;
                            alarmState = (alarmState | (1<<ulIdx)); //set bit
                            txData.command = ALARM_CMD;
                            txData.data = alarmState;
                            SendAthanPacket(MSG_LCD_CMD, &txData, sizeof(TsLCDTouchCmd));
                        }

                        drawMainMenu();
                        break;
                    }
                }
            }
        }

        while(touch_detectedTouch())
        {
            ;
        }
        //printDebugString("\n\r");

        //SendUARTCmd('A');
        //touch_updateCurrentTouch(&g_sTouchContext);

//        if(g_ranDemo == true)
//        {
//            g_ranDemo = false;
//            drawMainMenu();
//        }

//        if( g_sTouchContext.touch)
//        {
//            if(Graphics_isImageButtonSelected(&primitiveButton, g_sTouchContext.x,  g_sTouchContext.y)){
//                Graphics_drawSelectedImageButton(&g_sContext,&primitiveButton);
//                runPrimitivesDemo();
//            }else if (Graphics_isImageButtonSelected(&imageButton, g_sTouchContext.x,  g_sTouchContext.y)){
//                Graphics_drawSelectedImageButton(&g_sContext,&imageButton);
//                runImagesDemo();
//            }
//
//            if(g_ranDemo == true)
//            {
//                g_ranDemo = false;
//                drawMainMenu();
//            }
//        }
    }

